#Область ПрограммныйИнтерфейс 

Процедура ДополнитьФорму(Форма) Экспорт 

	ИмяФормы = Форма.ИмяФормы;
	
	Если Имяформы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
		ДобавитьГруппаИПолеСогласованнаяСкидкаИКоманду(Форма);
	ИначеЕсли Имяформы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма);
	ИначеЕсли Имяформы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс  


Процедура ДобавитьГруппаИПолеСогласованнаяСкидкаИКоманду(Форма)
			
	Если Форма.Элементы.Найти("ГруппаСкидкаКнопка") = Неопределено Тогда 	
		Группа = Форма.Элементы.Добавить("ГруппаСкидкаКнопка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	КонецЕсли; 
	
	Если Форма.Элементы.Найти("СогласованнаяСкидка") = Неопределено Тогда
		ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип ("ПолеФормы"), Форма.Элементы.ГруппаСкидкаКнопка);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
		ПолеВвода.УстановитьДействие("ПриИзменении", "ПриИзменении_ДЗ_СогласованнаяСкидка");
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ПересчитатьТаблицу") = Неопределено Тогда 	
		Команда = Форма.Команды.Добавить("ПересчитатьТаблицу");
		Команда.Заголовок = "Пересчитать таблицу";
		Команда.Действие = "КомандаПересчитатьТаблицу";
	КонецЕсли;
	
	КнопкаФормы = Форма.Элементы.Добавить("КомандаПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидкаКнопка);
	КнопкаФормы.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	КнопкаФормы.Картинка = БиблиотекаКартинок.Перечитать;
	КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст; 
		
КонецПроцедуры


Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип ("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры  

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.Основание);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры


#КонецОбласти